{
  "_name_or_path": "dmis-lab/biobert-base-cased-v1.1",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-DATE",
    "2": "I-DATE",
    "3": "B-NAME",
    "4": "I-NAME",
    "5": "B-LOCATION",
    "6": "I-LOCATION",
    "7": "B-NUMERIC",
    "8": "I-NUMERIC",
    "9": "B-PHONE",
    "10": "I-PHONE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-DATE": 1,
    "B-LOCATION": 5,
    "B-NAME": 3,
    "B-NUMERIC": 7,
    "B-PHONE": 9,
    "I-DATE": 2,
    "I-LOCATION": 6,
    "I-NAME": 4,
    "I-NUMERIC": 8,
    "I-PHONE": 10,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
